{
  "featured": "keyless-access-car",
  "items": [
    {
      "id": "keyless-access-car",
      "titulo": "Keyless Access Car — ACTIA & NXP",
      "parcerias": ["ACTIA", "NXP"],
      "periodo": "Academic Year 2025–2026",
      "status": "In progress",
      "intro": "Keyless access for a corporate fleet via smartphone/corporate authorization.",
      "descricao": "Innovative system to unlock fleet vehicles via smartphone using authorized corporate credentials. Year-long, high‑complexity project developed in partnership with ACTIA and NXP, involving cutting‑edge wireless communication, cryptography, and secure authentication.",
      "tecnologias": [ "Python", "UWB", "BLE", "Cryptography", "Mobile", "IoT", "AWS IoT Core"],
      "imagens": [
        "assets/img/keyless.jpg",
        "assets/img/keyless-app.jpg",
        "assets/img/keyless-hardware.jpg"
      ],
      "relatorio_pdf": "reports/keyless-access-car.pdf",
      "tags": ["Ultra Wideband", "IoT", "Security"]
    },
    {
      "id": "projeto-ml-fall-detection",
      "titulo": "Image Fall Detection with Machine Learning",
      "periodo": "1st Semester 2024",
      "status": "In progress",
      "intro": "Development of an ML model for automatic image classification using convolutional neural networks (CNN).",
      "descricao": "Machine‑learning project focused on computer vision using TensorFlow and Keras. The system can classify images into fall and no fall with high accuracy. End‑to‑end implementation from data collection to model deployment.",
      "tecnologias": ["Python", "TensorFlow", "Keras", "NumPy"],
      "imagens": [
        "assets/img/projeto-ml.jpg",
        "assets/img/projeto-ml-results.jpg"
      ],
      "relatorio_pdf": "reports/projeto-ml.pdf",
      "tags": ["ML", "Computer Vision", "Deep Learning"]
    },
    {
      "id": "app-gestao-tarefas",
      "titulo": "Task Management App",
      "periodo": "1st Semester 2024",
      "status": "Completed",
      "intro": "Responsive web app for managing tasks and projects with real‑time sync.",
      "descricao": "Full‑stack application built with React on the frontend and Node.js on the backend. Implements task creation, editing, and organization with an intuitive interface. Secure authentication and real‑time synchronization via WebSockets.",
      "tecnologias": ["React", "Node.js", "Express", "MongoDB", "WebSocket"],
      "imagens": [
        "assets/img/app-tarefas.jpg",
        "assets/img/app-tarefas-mobile.jpg"
      ],
      "relatorio_pdf": "reports/app-gestao-tarefas.pdf",
      "tags": ["Web", "Full Stack", "Real‑time"]
    },
    {
      "id": "sistema-monitoramento-iot",
      "titulo": "IoT Monitoring System for Agriculture",
      "periodo": "2nd Semester 2024",
      "status": "Completed",
      "intro": "IoT platform for monitoring environmental conditions in crops.",
      "descricao": "Complete Internet of Things system using ESP32 sensors to collect temperature, humidity, and light. Web dashboard for real‑time data visualization. Integration with automatic email alerts when critical thresholds are detected.",
      "tecnologias": ["ESP32", "Arduino", "MQTT", "Python", "Flask", "Chart.js"],
      "imagens": [
        "assets/img/iot-agriculture.jpg",
        "assets/img/iot-dashboard.jpg",
        "assets/img/iot-sensor.jpg"
      ],
      "relatorio_pdf": "reports/sistema-monitoramento-iot.pdf",
      "tags": ["IoT", "Hardware", "Agriculture", "Sensors"]
    },
    {
      "id": "api-rest-ecommerce",
      "titulo": "REST API for E‑commerce",
      "periodo": "1st Semester 2024",
      "status": "Completed",
      "intro": "Full RESTful API to manage products, orders, and users for an e‑commerce platform.",
      "descricao": "Robust backend following REST architecture best practices. Implements JWT authentication, data validation, error handling, and full documentation with Swagger. Integrated payments and complete inventory management with transaction control.",
      "tecnologias": ["Node.js", "Express", "PostgreSQL", "JWT", "Swagger"],
      "imagens": [
        "assets/img/api-ecommerce.jpg",
        "assets/img/api-swagger.jpg"
      ],
      "relatorio_pdf": "reports/api-rest-ecommerce.pdf",
      "tags": ["Backend", "API", "E‑commerce", "Database"]
    },
    {
      "id": "ethics",
      "titulo": "Social Psychology and Ethics",
      "periodo": "1st Semester 2025–2026",
      "status": "Completed",

      "intro": "Study of social psychology principles and ethical considerations in technology and in our engineering life.",

      "descricao": "Research project exploring key concepts in social psychology and their application to ethical decision-making in technology development. The project involved analyzing real-world case studies, identifying ethical dilemmas, and proposing guidelines for responsible engineering practice. It also included reflections on multicultural perspectives and how cultural context influences ethical judgments in everyday situations.",

      "papel": "Researcher and presenter",

      "sistema_aprendizado": "Blended learning combining lectures on social psychology and ethical frameworks, guided readings, and group discussions. The project was structured around a research report and an oral presentation, with continuous feedback from the instructor during TD-like discussion sessions.",

      "carga_horaria": {
        "cm": "Approximately 8 hours of lectures (CM) introducing core theories and ethical principles.",
        "td": "Approximately 6 hours of discussion-based sessions (TD) focusing on case study analysis and debate.",
        "tp": "Approximately 10 hours of project work (TP) dedicated to research, writing the report, and preparing the final presentation."
      },

      "competencias": {
        "tecnicas": [
          "Understanding of fundamental concepts in social psychology such as conformity, obedience, group dynamics, and cognitive biases.",
          "Ability to apply ethical frameworks (deontology, utilitarianism, virtue ethics) to real engineering and technology scenarios.",
          "Capability to analyze complex case studies and identify potential ethical risks in technology development."
        ],
        "transversais": [
          "Critical thinking and structured argumentation about ethical issues.",
          "Written and oral communication skills through the report and final presentation.",
          "Teamwork and collaborative decision-making in defining ethical guidelines and recommendations."
        ]
      },

      "justificativa": "This project is important because it connects human psychology with ethical responsibility in technology. As engineers, we do not only design systems; we also influence people's behavior and society at large. Understanding how social pressures and cognitive biases affect decisions helps prevent unethical practices and supports more responsible engineering choices.",

      "relacao_projeto_profissional": "In my future professional path, I aim to work on technology and engineering projects that have a strong impact on people's daily lives. This project prepared me to integrate ethical reflection into technical decision-making, to question the social consequences of design choices, and to promote a culture of responsibility within engineering teams and organizations.",

      "resultados": "Comprehensive written report and oral presentation summarizing theoretical foundations in social psychology, key ethical issues in technology, and a set of practical recommendations for responsible engineering practices within multicultural contexts.",

      "tecnologias": [
        "Canva for creating visual slides and diagrams",
        "Presentation tools for delivering the oral defense",
        "Online academic databases and digital libraries for research"
      ],

      "imagens": [
        "assets/img/ethics.jpg"
      ],

      "relatorio_pdf": "reports/ethics.pdf",

      "tags": [
        "Ethics",
        "Social Psychology",
        "Research",
        "Professional Responsibility"
      ]
    }
  ]
}
