{
  "featured": "keyless-access-car",
  "items": [
    {
      "id": "keyless-access-car",
      "titulo": "Keyless Access Car — ACTIA & NXP",
      "periodo": "Academic Year 2025-2026",
      "status": "In progress",
      "tecnologias": ["Python","UWB","BLE","Cryptography","IoT","AWS IoT Core"],
      "tags": ["Ultra Wideband","IoT","Security"],
      "imagens": ["assets/img/keyless.jpg","assets/img/NXP_board.jpg","assets/img/keyless-hardware.jpg"],
      "relatorio_pdf": "reports/keyless-access-car.pdf",
      "descricao": "Innovative system to unlock fleet vehicles via smartphone using authorized corporate credentials. Year-long, high-complexity project developed in partnership with ACTIA and NXP, involving cutting-edge wireless communication, cryptography, and secure authentication. This project aims to revolutionize fleet management by providing a seamless and secure keyless access solution that leverages modern mobile technology and industrial-grade security protocols.",
      "tecnica": "The project focuses on implementing Ultra-Wideband (UWB) technology for precise distance measurement and Bluetooth Low Energy (BLE) for initial device discovery and communication. We utilize advanced cryptographic algorithms including AES-256 for data encryption and RSA for key exchange to ensure secure communication between the smartphone and the vehicle. The system architecture involves AWS IoT Core for cloud-based device management, authentication services, and real-time monitoring. Python is used for backend services and mobile application integration. The technical challenges include managing precise ranging measurements, implementing replay attack prevention, ensuring low power consumption, and maintaining robust security across all communication layers.",
      "sistema_de_curso": "This is a capstone project structured over two semesters with approximately 300 hours of total workload. The project involves weekly progress meetings with industrial partners ACTIA and NXP (1-2 hours per week), bi-weekly technical review sessions with academic supervisors, and hands-on development work including prototyping, coding, testing, and documentation. The work is divided into phases: requirements analysis and system design (semester 1), implementation and integration (semester 1-2), testing and validation (semester 2), and final presentation and documentation (semester 2). Activities include literature review, technical specifications writing, hardware prototyping, software development, security analysis, performance testing, and preparation of technical reports and presentations.",
      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Wireless Communication Protocols"},
        {
          "nota": 4,
          "titulo": "Cryptography and Security"},
        {
          "nota": 3,
          "titulo": "Cloud Integration and IoT Architecture"},
        {
          "nota": 3,
          "titulo": "Project Management and Industrial Collaboration"}
      ],
      "justificativa": "I rated my competence in wireless communication protocols as 4 because I successfully implemented both UWB ranging and BLE communication, overcoming technical challenges related to signal interference and precision. For cryptography and security, I achieved level 4 by implementing a complete security architecture including encryption, authentication, and attack prevention mechanisms, which was validated through security audits. My cloud integration competence is at level 3 as I successfully integrated AWS IoT Core services but with guidance from NXP engineers for some advanced configurations. Project management is rated 3 because I effectively coordinated between multiple stakeholders and maintained project timelines, though the complexity required occasional supervisor intervention for critical decisions.",
      "relacao_projeto_profissional": "This project directly aligns with my career goal of working in the embedded systems and IoT industry, particularly in automotive and security-focused applications. The competences developed in wireless communication, cryptography, and cloud integration are essential for modern connected vehicle systems and smart mobility solutions. I aim to pursue roles such as IoT Systems Engineer or Embedded Security Specialist in automotive companies or technology firms developing next-generation connected devices. The experience with industrial partners ACTIA and NXP has provided valuable insights into industry practices, standards, and the complete product development lifecycle, which will be crucial for my professional success in embedded systems and IoT domains."
    },



    {
      "id": "projeto-ml-fall-detection",
      "titulo": "Image Fall Detection with Machine Learning",
      "periodo": "1st Semester 2025-2026",
      "status": "In progress",
      "tecnologias": ["Python","TensorFlow","Keras","NumPy"],
      "tags": ["Machine Learning","Computer Vision","Deep Learning"],
      "imagens": ["assets/img/projeto-ml.jpg","assets/img/projeto-ml-results.jpg"],
      "relatorio_pdf": "reports/projeto-ml.pdf",
      "descricao": "Machine-learning project focused on computer vision using TensorFlow and Keras to detect falls in images. The system employs convolutional neural networks (CNN) to classify images into fall and no-fall categories with high accuracy. This project addresses a critical need in elderly care and safety monitoring by providing automated detection capabilities that can alert caregivers in real-time. The end-to-end implementation covers data collection, preprocessing, model training, validation, and deployment considerations.",
      "tecnica": "The technical core involves designing and training a Convolutional Neural Network (CNN) architecture using TensorFlow and Keras frameworks. We explored various architectures including custom CNNs and transfer learning approaches using pre-trained models such as VGG16 and ResNet50. Data preprocessing includes image normalization, augmentation techniques (rotation, flipping, zooming) to improve model generalization, and proper train-validation-test splitting. The model training process involves hyperparameter tuning (learning rate, batch size, number of epochs), implementation of callbacks for early stopping and learning rate scheduling, and use of appropriate loss functions and optimizers (Adam, SGD). Performance evaluation uses metrics including accuracy, precision, recall, F1-score, and confusion matrices. NumPy is extensively used for numerical operations and data manipulation throughout the pipeline.",
      "sistema_de_curso": "This project was conducted as part of a Machine Learning course with approximately 60 hours of workload over one semester. The course structure included theoretical lectures (CM) covering ML fundamentals, neural networks, and computer vision concepts (20 hours), practical tutorial sessions (TD) for hands-on coding exercises and problem-solving (15 hours), and supervised lab sessions (TP) where the project was developed incrementally (25 hours). Activities included studying ML theory, implementing algorithms from scratch for learning purposes, working on the fall detection project with weekly milestones, presenting progress updates, and preparing a final technical report and demonstration.",
      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Be able to explain the main concepts of AI at the edge"},
        {
          "nota": 4,
          "titulo": "Dimension an AI tool for an application at the edge: communication bandwidth, latency, realiability of the model decisions, and privacy."},
        {
          "nota": 3,
          "titulo": "Set up a machine learning workflow on heterogeneous IoT data (tabular, images, temporal series)"},
        {
          "nota": 4,
          "titulo": "Use Python machine learning libraries and compression methods"}
      ],
      "justificativa": "My deep learning competence is rated 3 because I successfully designed, trained, and optimized CNN models, though some advanced techniques like custom loss functions required additional research. Computer vision competence is also 3 as I effectively applied preprocessing and augmentation techniques that significantly improved model performance. Model evaluation is rated 2 because while I used appropriate metrics and validation strategies, I could improve in advanced techniques like cross-validation and bias-variance analysis. Python programming for ML is rated 3 as I demonstrated proficiency in using TensorFlow and Keras frameworks, implementing the complete pipeline independently with occasional reference to documentation.",
      "relacao_projeto_profissional": "This project is highly relevant to my interest in intelligent embedded systems and IoT applications. Machine learning, particularly computer vision, is increasingly integrated into embedded devices for edge computing scenarios. I aspire to work in areas where ML models are deployed on resource-constrained devices for real-time applications such as smart surveillance, autonomous systems, or health monitoring. The competences in ML model development, optimization, and evaluation are essential for roles like ML Engineer, Computer Vision Specialist, or Embedded AI Developer. This experience provides a foundation for future work in deploying ML models on edge devices, which is a growing field in IoT and smart systems."
    },


    
    {
      "id": "energy-for-connected-objects",
      "titulo": "Energy for connected objects",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": ["Raspberry Pi", "SDR", "Rectenna (RF-to-DC)", "PMU", "Supercapacitor"],
      "tags": ["IoT", "Energy Harvesting", "Wireless Power Transfer", "Battery-free", "Low-power design", "RF"],
      "imagens": ["assets/img/energy.png"],
      "relatorio_pdf": "reports/energy_connected_objects.pdf",
      "descricao": "Energy for Connected Objects focused on powering low-power IoT nodes without wires and without conventional batteries, combining energy storage, ambient energy harvesting, and wireless power transfer. The course connected the physics of energy conversion with practical design choices required to build energy-autonomous sensing nodes. Hands-on lab work explored what “battery-free” really means in practice: how much energy is needed for a task, what power levels are realistically available, and which architecture makes the system robust to fluctuations. The final report documented the full chain from RF capture to DC power management and real-world constraints such as non-linearities and propagation effects.",
      "tecnica": "The course covered three main approaches: (1) electricity storage (capacitors/inductors versus indirect options like batteries/supercapacitors), focusing on usable energy, voltage thresholds, losses, and regulation needs; (2) ambient harvesting (light, mechanical, thermal, electromagnetic), emphasizing variability and order-of-magnitude feasibility checks; and (3) wireless power transfer with dedicated sources, including near-field vs far-field regimes, free-space losses, and practical ISM-band considerations. A rectenna-based chain was used as a reference architecture for RF harvesting/WPT: antenna, impedance matching, RF-to-DC rectifier, and DC filtering/storage, with an emphasis on end-to-end co-optimization. In the lab, the work started from a power budget for a red LED and compared two strategies: direct consumption (antenna → rectifier → LED) versus store-then-use (PMU + DC-DC + supercapacitor) to accumulate energy and then discharge at a controlled operating point. Rectifier characterization used frequency sweeps in the 868 MHz and 2.45 GHz bands with an SDR-based setup; observations highlighted parasitics/non-linearities and the impact of antenna choice and polarization alignment in over-the-air tests.",
      "sistema_de_curso": "The course was organized into four 1h15 lecture sessions and two 2h45 laboratory sessions, progressing from general concepts (energy, storage, harvesting) to electromagnetic wireless power transfer and design guidelines for low-power connected objects. Assessment relied on lab attendance and a group report summarizing the work carried out (context, choices, issues and solutions, conclusions), plus a reflection on energy autonomy for an innovative project.",
      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Know how to harvest/transfer, store and manage power for connected objects, and how to increase power efficiency"
        },
        {
          "nota": 4,
          "titulo": "Be able to optimize the power consumption of connected objects"
        },
        {
          "nota": 4,
          "titulo": "Be able to design and implement an energy-autonomous and battery-free connected object"
        }
      ],
      "justificativa": "These scores reflect both the breadth of the course content and the fact that the lab validated the full reasoning chain from requirements to implementation constraints. The work combined power budgeting, architecture selection (direct vs store-then-use), and system-level interpretation of RF measurements, including MPPT dynamics and antenna/polarization effects. Writing the final report also required explaining decisions and limitations clearly, matching the intended learning outcomes of designing energy-autonomous connected objects under realistic constraints.",
      "relacao_projeto_profissional": "This course directly supports embedded systems and IoT work by grounding low-power design in realistic energy constraints rather than only computation and communication requirements. Understanding how storage thresholds, duty cycling, and RF link conditions translate into usable DC power is a practical skill for deployable sensor nodes in constrained environments. Battery-free and maintenance-free sensing is particularly relevant for industrial monitoring use cases where replacing batteries is costly or impossible; the end-to-end rectenna-based approach clarified what is feasible with ambient RF versus dedicated WPT and highlighted improvement levers such as antenna strategy, matching, and power-management choices when pushing for range and robustness."
    },

    {
      "id": "m2m",
      "titulo": "Machine to Machine",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": ["ESP8266 (NodeMCU)", "C++", "MQTT", "Eclipse Mosquitto", "Arduino IDE", "Node-RED", "Home Assistant", "ArduinoHA"],
      "tags": ["IoT", "MQTT protocol", "MQTT Broker", "Communications", "Smart Home"],
      "imagens": ["assets/img/m2m.jpeg", "assets/img/m2m.png"],
      "relatorio_pdf": "reports/m2m.pdf",
      "descricao": "This course strengthened how to think about machine-to-machine communication as an engineering system: devices, middleware, and the application layer working together in a coherent architecture. The main focus was understanding how constrained IoT nodes can exchange data reliably and securely using MQTT, then building an end-to-end pipeline that remains easy to test, extend, and supervise.\n\nBeyond the technical stack, the course was especially useful because it connected directly to projects running in parallel during the semester. Concepts and tools from the labs were reused in an open-source project (a gas sensor application) and also in my Innovative Project (keyless car entry) where MQTT is part of the cloud integration through AWS IoT Core, which helped reinforce the “why” behind each design choice.",
      "tecnica": "The course covered IoT fundamentals and platform challenges (heterogeneity, interoperability, security, and quality of service), then narrowed down to practical middleware building blocks for connected systems. MQTT was introduced as a lightweight publish/subscribe protocol designed for sensors and actuators, relying on a broker to manage client sessions and route messages through topic-based queues. Key topics included MQTT over TCP/IP, topic hierarchies, retained messages, keep-alive mechanisms, will messages for disconnect handling, and QoS levels (0, 1, 2) to balance reliability versus overhead.\n\nHands-on work started by installing and validating an Eclipse Mosquitto broker and testing publish/subscribe behavior using command-line clients. The labs then moved to embedded implementation with an ESP8266 (NodeMCU) programmed in Arduino IDE: Wi-Fi connectivity, MQTT client setup, and bidirectional messaging with both publications (telemetry/events) and subscriptions (remote commands). A simple smart-home scenario structured the application logic around dedicated topics for button state, luminosity measurements, and light commands, illustrating how manual and automatic behaviors can coexist through clear topic design.\n\nNode-RED was used for fast prototyping of higher-level applications on top of MQTT. Flow-based logic enabled quick parsing, routing, and rule evaluation, and dashboards provided real-time visualization and interaction (charts, controls, debug traces). The same middleware reasoning was later extended to specialized platforms with Home Assistant, where entities, services, and device organization provide a more structured supervision layer. Using ArduinoHA, the ESP8266 was integrated as a Home Assistant device and exposed controllable entities, highlighting naming conventions, scalability considerations, and practical security measures such as authentication and the possibility of TLS when needed. Energy-related considerations were also addressed through message frequency, connection efficiency, and the availability of low-power modes on the ESP8266 for battery-powered deployments.",
      "sistema_de_curso": "The course combined 3 lecture sessions (1h15 each) with 4 laboratory sessions (2h45 each). The course content introduced IoT architecture and interoperability challenges, then focused on MQTT principles and rapid prototyping with Node-RED, before exploring specialized middleware with Home Assistant. The labs progressively validated an end-to-end chain: broker installation and testing, embedded MQTT client development on ESP8266, application orchestration and dashboards in Node-RED, and device integration into Home Assistant using ArduinoHA.",
      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Know how to situate the main standards for the Internet of Things"
        },
        {
          "nota": 4,
          "titulo": "Deploy an architecture compliant to an IoT standard and implement a sensor network"
        },
        {
          "nota": 4,
          "titulo": "Deploy and configure an IoT architecture"
        },
        {
          "nota": 4,
          "titulo": "Interact with the different resources of the architecture using REST services"
        },
        {
          "nota": 4,
          "titulo": "Integrate a new technology into the deployed architecture"
        }
      ],
      "justificativa": "The rating is high across all competencies because the course required both understanding and execution: selecting the right communication model, deploying the broker infrastructure, building an embedded client, and validating interactions end-to-end with real tools. The lab sequence also demonstrated how to move from a working prototype (MQTT + Node-RED) to a more structured ecosystem (Home Assistant with entities and services), which reflects real product workflows. I saw immediate impact in other semester projects, since Node-RED and MQTT were reused in an open-source gas sensor application and in my Innovative Project (keyless car entry) with AWS IoT Core, reinforcing the transferability of these skills.",
      "relacao_projeto_profissional": "This course maps directly to embedded and IoT roles where the core challenge is connecting devices to a reliable middleware layer and exposing data/controls to applications safely and maintainably. MQTT-based architectures are common in smart home, industrial monitoring, and connected mobility, and the ability to design topics, reason about QoS, and debug broker-level behavior is practical day one value.\n\nOn a personal level, the course also improved confidence in technical discussions during recruiting. Knowledge from this module helped me during an interview for “Innovation IoT: Connectez un Objet Intelligent via de multiples Protocoles de Communication” at Thales, where MQTT and LwM2M were part of the expected communication stack, and the lab-driven understanding made it easier to explain architectural choices and trade-offs."
    },

    {
      "id": "wireless-sensor-networks",
      "titulo": "Wireless Sensor Networks",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": [],
      "tags": [],
      "imagens": ["assets/img/wsn.jpg"],
      "relatorio_pdf": "reports/wireless_sensor_networks.pdf",
      "descricao": "",
      "tecnica": "",
      "sistema_de_curso": "",
      "matriz_competencia": [
        {
          "nota": 0,
          "titulo": ""
        }
      ],
      "justificativa": "",
      "relacao_projeto_profissional": ""
    },

    {
      "id": "cloud-and-edge-computing",
      "titulo": "Cloud and Edge Computing",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": [],
      "tags": [],
      "imagens": ["assets/img/edge-computing.jpg"],
      "relatorio_pdf": "reports/edge_computing.pdf",
      "descricao": "",
      "tecnica": "",
      "sistema_de_curso": "",
      "matriz_competencia": [
        {
          "nota": 0,
          "titulo": ""
        }
      ],
      "justificativa": "",
      "relacao_projeto_profissional": ""
    },
    
    {
      "id": "from3gto6g",
      "titulo": "From 3G to 6G",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": ["3GPP","UMTS","LTE","5G", "6G","Literature Review","Oral Presentation"],
      "tags": ["Wireless Communications","Mobile Networks","Telecom Standardization","IoT","Spectrum","EM Waves","mmWave","Health & Safety","Semiconductor Scaling (nm/Å nodes)"],
      "imagens": ["assets/img/from3gto6g.jpg"],
      "relatorio_pdf": "reports/from3gto6g.pdf",
      "descricao": "In this course, a structured understanding was built around how mobile networks evolved from 3G to today's 5G era and how the industry is already shaping the path toward 6G. The focus went beyond “what changed” generation by generation (services, performance, spectrum), and also addressed why it changed through market dynamics, technology scaling, and global standardization processes.\n\nA controversial but essential topic for modern wireless systems was also explored: the potential health impacts of electromagnetic (EM) waves and the societal concerns surrounding mobile deployments. The work aimed to keep a balanced view, separating established physical mechanisms (mainly thermal effects) from debated non-thermal hypotheses, while explaining why scientific opinions can diverge depending on methods, exposure metrics, and evidence quality.",
      "tecnica": "The course covered the ecosystem that drives mobile-network innovation, linking technical evolution to market cycles, investment dynamics, and the push from smartphones, IoT adoption, and industrial connectivity. This “market lens” clarified why each new generation is not only a performance upgrade, but also a response to demand, competition, and feasibility at scale.\n\nKey topics included how mobile technologies become “official” through global standardization. The role of 3GPP was studied as a partnership framework that consolidates specifications defining architecture, protocol layers, interfaces, requirements, and testing for GSM/UMTS/LTE/5G NR, while also structuring the transition to 5G-Advanced and early 6G roadmaps via Release planning and timelines.\n\nFrom a physical-layer perspective, the work focused on how spectrum selection and propagation constraints shape system design. Coverage vs. capacity trade-offs were connected to the progressive move toward higher frequencies, and the implications were discussed in terms of wavelength, antenna integration, and the practical need for antenna arrays, beamforming, and massive MIMO to maintain link budget and increase throughput. Basic RF relationships (frequency-wavelength links and related measurement concepts) were used to ground these conclusions.\n\nThe hardware dimension was also emphasized: semiconductor scaling as an enabler for higher integration, stronger compute capabilities, and tighter coupling between communication and AI features. Expected directions for 6G were examined, including wider bandwidths (potentially extending toward sub-THz/terahertz ranges), improved localization, network automation with AI/ML, and the emergence of concepts such as battery-less or “zero-energy” devices for massive sensing and data collection.\n\nFor the selected topic (Cancer & EM waves), the course required a state-of-the-art review approach. Exposure concepts (device proximity, infrastructure, and typical field levels) were placed alongside the mainstream emphasis on thermal effects, then contrasted with publications that argue for possible long-term non-thermal impacts versus sources highlighting limitations in replication, dosimetry, and the difficulty of extrapolating lab conditions to real-world human physiology. I presented this synthesis in an evaluated oral talk, concluding with a pragmatic precaution stance: reduce unnecessary exposure when feasible without turning uncertainty into alarmism.",
      "sistema_de_curso": "The course was organized as 6 sessions of about 1h15: 2 instructor-led lectures to build the historical and technical foundation (market context, spectrum, standardization, technology scaling, roadmap to 6G), followed by 4 student presentation sessions. Students worked in pairs, each selecting a topic (e.g., 6G modulation, satellites, vehicle connectivity, mmWave threats, mobile addiction, cancer & EM waves) and delivering a 10-15 minute oral presentation followed by Q&A, which served as the main evaluation method.",
      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Mastery of new mobile network technologies"}
      ],
      "justificativa": "These ratings reflect what was practiced in the course: a clear generation-by-generation model (services, spectrum, and KPIs) was consolidated, connected to the 3GPP release logic, and grounded with RF fundamentals explaining why higher frequencies require new antenna strategies. The health-focused topic was handled as a structured synthesis rather than a “settled” claim, highlighting mechanisms, evidence limits, and interpretation gaps then delivered through an evaluated oral presentation with a responsible conclusion.",
      "relacao_projeto_profissional": "This course directly supports my professional trajectory in embedded systems and connected devices because it connects real industry constraints (standardization, roadmap timing, spectrum availability, hardware scaling) to the design decisions behind IoT and mobile connectivity. Understanding the 3GPP ecosystem and the evolution from LTE to 5G NR and beyond helps position cellular IoT technologies within realistic constraints for products and industrial systems. This knowledge also proved immediately useful in my interview at Thales for the “R&I: Communications V2X et Sécurité 5G” role, where I could discuss these constraints and trade-offs with concrete technical grounding.\n\nIt also strengthened my ability to account for societal and safety concerns that still influence engineering decisions. For roles involving IoT, smart systems, or telecom-connected embedded products, discussing EM exposure questions responsibly without exaggeration, but with technical grounding and awareness of uncertainty adds value when designing systems, documenting risk, or communicating with stakeholders."
    },

    {
      "id": "ethics",
      "titulo": "Social Psychology and Ethics",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": ["Presentation","Research"],
      "tags": ["Ethics","Social Psychology","Group Dynamics", "Intercultural Communication"],
      "imagens": ["assets/img/ethics.jpg"],
      "relatorio_pdf": "reports/ethics.pptx",
      "descricao": "\nIn this course I was introduced to social psychology as a human sciences discipline that studies the relationships between individuals, groups and situations. We explored how group dynamics, influence, stereotypes, intercultural relations, manipulation, conflict management and psychosocial risks shape behaviours in everyday life and in professional settings.\n\nAll these concepts were constantly questioned from an ethical perspective: who is responsible for what, what makes an action just, and what it means for an action to be truly free. A central part of the course was also devoted to ethics in engineering and to intercultural communication, which I worked on through a dedicated presentation on intercultural relations and cultural adaptation.",
      "tecnica": "\nThe course began with a detailed analysis of the movie 12 Angry Men (1957), used as a practical case for social influence and group decision-making. Through this film, group pressure, minority influence, stereotypes linked to social class and origin, and the tension between emotional and rational arguments were examined. The character who insists on questioning the evidence served as an example of how one individual can progressively shift a group decision by demanding a more rigorous, fact-based discussion.\n\nKey topics included the foundations of social psychology and group dynamics, at the crossroads between psychology and sociology. Lectures covered the interaction between individual, group and situation, with reference to authors such as Elton Mayo (Hawthorne effect and the role of social motivation), Jacob Moreno (sociometry and affective networks inside groups) and Kurt Lewin (field theory and group dynamics as a system of forces). Criteria for defining a group were presented (minimum number of people, shared goals, interdependence, roles, norms and shared values), along with distinctions between crowds, small primary groups, large temporary groups and formal organisations.\n\nAs part of the course, together with a classmate, I prepared and delivered a full presentation on intercultural communication. The work started from the UNESCO definition of culture as a set of values, norms, practices, beliefs and ways of life shared by a group, emphasising that culture also involves invisible dimensions such as communication styles and relationships to time, authority and emotions. The notion of micro-cultures was introduced to describe families, student cohorts, project teams or local communities, each with its own codes and rituals, which explains why people from the same country can behave very differently. Intercultural communication was defined as interaction between people with different cultural references, requiring competences such as active listening, curiosity, reflexivity, the ability to question stereotypes and to manage uncertainty in exchanges.\n\nThe presentation also explored practical strategies for adapting to other cultures: maintaining an open attitude, observing without immediate judgement, adjusting verbal and non-verbal communication (simplifying language, paying attention to body language, respecting hierarchy where it matters) and asking for clarification when necessary. The classic phases of cultural adaptation (honeymoon, slump, realisation and adaptation) were described to show that cultural shock is a normal stage in the learning process. Another key concept was ethnocentrism - the tendency to see one's own culture as the central or superior reference - and the importance of recognising it in order to build more respectful and effective intercultural relations. Practical tools for communicating across cultures were proposed: using clear and concrete language, avoiding jargon and idioms, combining oral explanations with written notes or diagrams, providing concrete examples and regularly checking understanding by asking others to reformulate the message.\n\nOn the ethical side, the course worked with precise distinctions between morality, ethics and deontology. Morality was presented as a set of values and concrete rules that distinguish good from bad, ethics as a reflective process that questions human actions and their consequences, and deontology as the set of duties linked to a professional practice. Several ethical frameworks for decision-making were studied: ethics of reciprocity (“treat others as you would like to be treated”), duty-based ethics (Kantian universal principles), utilitarian ethics (seeking the greatest good for the greatest number) and ethics of conviction (coherence between personal values and actions). These frameworks provided a structured way to analyse dilemmas.\n\nThe course also highlighted a three-question approach to ethical reflection: Where does a practice come from (historical and social origins)? What is it for (meaning and usefulness)? Where is it going (long-term impacts and finalities)? This method was applied to engineering topics to connect technical possibilities with social effects and personal responsibility. Digital ethics completed the technical content with questions about cybercrime, manipulation, privacy and data protection, big data, social media, right to disconnect and the environmental footprint of digital technologies, including energy consumption and electronic waste.\n\nFinally, the responsibilities of engineers were discussed through ethical charters and case studies. Emphasis was placed on the need to balance what is technically possible with what is socially desirable, by assessing risks, long-term impacts and the social acceptability of technologies. This integrated view of ethics, group dynamics and intercultural communication forms a methodological base for future work with connected objects, data and smart systems.",
      "sistema_de_curso": "The course was organised in around 14 sessions of 1h15. Teaching combined a common screening and discussion of 12 Angry Men, interactive lectures based on the professor's slides on social psychology, group dynamics, ethics and digital issues, and student-led presentations. The class was divided into pairs, each pair preparing a 20-30 minute presentation on a specific topic such as influence, manipulation, stereotypes, intercultural relations, conflict management, psychosocial risks or digital ethics, followed by a structured debate with the rest of the group. Readings, short exercises and whole-class discussions were used to connect theory with concrete situations and with the role of engineers.",
      "matriz_competencia": [
        {
          "nota": 3,
          "titulo": "Analyse Group Situations Using Concepts from Social Psychology"},
        {
          "nota": 3,
          "titulo": "Understand Interpersonal Relations in Professional and Intercultural Situations"},
        {
          "nota": 3,
          "titulo": "Integrate Reflection on Socio-Ecological Issues into Career Path"},
        {
          "nota": 3,
          "titulo": "Identify the Ethical Dimensions of Situations and Argue One's Position"},
        {
          "nota": 3,
          "titulo": "Sharpen Critical Thinking, Decentring and Self-Reflection: Meta-Cognition"}
      ],
      "justificativa": "Level 3 is appropriate for all these competencies because they were mobilised repeatedly throughout the course, even if still at a student level rather than in a professional position. Through the film analysis, group presentations and debates, it became possible to identify ethical and intercultural issues while remaining attentive to people's limits and vulnerabilities. Preparing and delivering the presentation on intercultural communication required questioning the objectives and implicit assumptions behind ways of working together, reflecting on stereotypes and ethnocentrism, and considering the social acceptability of behaviours and communication styles. The need to structure arguments, adapt explanations to a diverse audience and react in real time to questions corresponds to agile implementation of chosen strategies. Continuous reflection on personal values, cultural background, biases and reactions - for example in discussions on discrimination, digital surveillance or cultural shock - supported a genuinely reflective evaluation of progress and limitations.",
      "relacao_projeto_profissional": "This course is connected to my professional project as an engineer working with embedded systems, IoT and smart, data-driven technologies in international and multicultural environments. In these fields, technical choices affect privacy, safety, environmental impact, work organisation and power relations inside companies and in society, and they are often implemented by teams composed of people with very different cultural backgrounds. Studying social psychology, ethics and intercultural communication helped to see teams, organisations and users as complex groups with histories, norms and expectations, and to anticipate how technologies and communication styles can reinforce or challenge existing dynamics.\n\nFor future roles in industry or research, this background supports the ability to question the purpose of the systems being designed, to evaluate their social and environmental impacts, and to defend responsible choices when facing dilemmas between performance, cost and ethical concerns. The specific work on intercultural communication strengthened the capacity to collaborate with international colleagues, adapt language and behaviour, and transform cultural differences into an asset rather than a source of conflict. Altogether, the course contributes to building a professional profile of an engineer who is technically competent and also aware of his responsibilities towards people, organisations and the broader society."
    },

    {
      "id": "physical_education",
      "titulo": "Physical Activity in Nature",
      "periodo": "1st Semester 2025-2026",
      "status": "Completed",
      "tecnologias": ["Kayak", "Archery", "Electronic shooting", "Bike"],
      "tags": ["Outdoor", "Nature", "River", "Off-road"],
      "imagens": ["assets/img/bike.jpg", "assets/img/kayak.jpg"],
      "relatorio_pdf": "",
      "descricao": "This three-day outdoor module combined physical challenge, nature immersion, and group coordination through kayaking on a river near Toulouse, archery and electronic shooting practice, and a 22 km off-road cycling route.\n\nBeyond fitness, the experience strengthened social bonds at the start of the semester and created a practical context for decision-making, safety awareness, and mutual support. Photos of the kayaking and cycling sessions are included as appendices to represent the activities completed.",
      "tecnica": "The module focused on operating safely in natural environments while adapting to changing conditions and working efficiently as a group. The kayaking day emphasized route awareness, coordination between paddlers, and fast reaction to obstacles such as small drops and unstable flows.\n\nHands-on work required using specific equipment correctly (helmet, buoyancy aid, paddle handling, and basic river navigation behaviors), as well as applying safety procedures to prevent falls and respond quickly when someone entered the water. I contributed by staying proactive in communication, keeping the group organized during critical moments, and helping ensure a rapid, calm response when assistance was needed.\n\nThe second day developed precision and focus through archery and electronic shooting, reinforcing controlled posture, attention management, and consistent execution under observation. The final cycling route demanded endurance, pacing strategy, and terrain handling, with off-road sections requiring stability, anticipation, and respect for the group’s rhythm to avoid unnecessary risks.\n\nAcross all activities, environmental responsibility was treated as part of performance: keeping personal items secured, leaving no waste behind, and preserving the natural area while moving through it.",
      "sistema_de_curso": "The course was organized as three full outdoor days, each centered on a different activity (river kayaking, archery and electronic shooting, and off-road cycling). Instruction and supervision guided safe equipment use and group behavior, and the assessment relied mainly on observed engagement, adaptation to the environment, and demonstrated safety and teamwork behaviors aligned with the competency matrix.",
      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Take action in a natural environment: analyze, decide, act, put security in place, use specific equipment, discover an area"},
        {
          "nota": 4,
          "titulo": "Respect and adapt in an environment different from one’s normal habits"},
        {
          "nota": 4,
          "titulo": "Invest oneself coherently in activities"},
        {
          "nota": 4,
          "titulo": "Actively take part in a community"}
      ],
      "justificativa": "All four scores are consistent with how the three days were experienced in practice. On the river, fast decision-making, clear communication, and teamwork were necessary to keep the kayak stable in technical sections and to react quickly and safely when a teammate needed help. The archery and electronic shooting sessions reinforced focus, self-control, and disciplined execution, while the off-road cycling route required endurance, pacing, and careful terrain handling without losing attention to group safety.\n\nThe community dimension also deserves a top score because this module actively strengthened our cohort. Sharing challenges outdoors created trust, encouraged collaboration, and helped integrate classmates early in the semester. I engaged strongly with my colleagues throughout the activities, contributing to group motivation, coordination, and the positive atmosphere that made the experience unifying rather than just individual performance.",
      "relacao_projeto_profissional": "This module is not directly tied to a specific engineering domain, but it reinforces behaviors that transfer strongly to technical projects: teamwork under pressure, leadership by action, disciplined execution, and following safety constraints while staying goal-oriented.\n\nIn engineering environments, the same skills apply when managing risk, coordinating roles, and reacting to unexpected events without compromising the team’s stability. This experience also highlighted how community engagement improves performance: stronger bonds and communication make teams faster, safer, and more resilient during demanding work."
    }
  ]
}
