{
  "featured": "keyless-access-car",
  "items": [
    {
      "id": "keyless-access-car",
      "titulo": "Keyless Access Car — ACTIA & NXP",
      "periodo": "Academic Year 2025–2026",
      "status": "In progress",

      "tecnologias": [
        "Python",
        "UWB",
        "BLE",
        "Cryptography",
        "Mobile",
        "IoT",
        "AWS IoT Core"
      ],

      "tags": [
        "Ultra Wideband",
        "IoT",
        "Security"
      ],

      "imagens": [
        "assets/img/keyless.jpg",
        "assets/img/keyless-app.jpg",
        "assets/img/keyless-hardware.jpg"
      ],

      "relatorio_pdf": "reports/keyless-access-car.pdf",

      "descricao": "Innovative system to unlock fleet vehicles via smartphone using authorized corporate credentials. Year-long, high-complexity project developed in partnership with ACTIA and NXP, involving cutting-edge wireless communication, cryptography, and secure authentication. This project aims to revolutionize fleet management by providing a seamless and secure keyless access solution that leverages modern mobile technology and industrial-grade security protocols.",

      "tecnica": "The project focuses on implementing Ultra-Wideband (UWB) technology for precise distance measurement and Bluetooth Low Energy (BLE) for initial device discovery and communication. We utilize advanced cryptographic algorithms including AES-256 for data encryption and RSA for key exchange to ensure secure communication between the smartphone and the vehicle. The system architecture involves AWS IoT Core for cloud-based device management, authentication services, and real-time monitoring. Python is used for backend services and mobile application integration. The technical challenges include managing precise ranging measurements, implementing replay attack prevention, ensuring low power consumption, and maintaining robust security across all communication layers.",

      "sistema_de_curso": "This is a capstone project structured over two semesters with approximately 300 hours of total workload. The project involves weekly progress meetings with industrial partners ACTIA and NXP (1-2 hours per week), bi-weekly technical review sessions with academic supervisors, and hands-on development work including prototyping, coding, testing, and documentation. The work is divided into phases: requirements analysis and system design (semester 1), implementation and integration (semester 1-2), testing and validation (semester 2), and final presentation and documentation (semester 2). Activities include literature review, technical specifications writing, hardware prototyping, software development, security analysis, performance testing, and preparation of technical reports and presentations.",

      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Wireless Communication Protocols",
          "descricao": "Deep understanding and practical implementation of UWB and BLE protocols for secure device communication and ranging in automotive applications."
        },
        {
          "nota": 4,
          "titulo": "Cryptography and Security",
          "descricao": "Application of advanced cryptographic techniques including symmetric and asymmetric encryption, secure key management, and protection against common attack vectors in IoT systems."
        },
        {
          "nota": 3,
          "titulo": "Cloud Integration and IoT Architecture",
          "descricao": "Design and implementation of cloud-based IoT solutions using AWS IoT Core for device management, authentication, and real-time data processing."
        },
        {
          "nota": 3,
          "titulo": "Project Management and Industrial Collaboration",
          "descricao": "Coordination of a complex multi-stakeholder project involving industrial partners, academic supervision, and adherence to real-world deadlines and requirements."
        }
      ],

      "justificativa": "I rated my competence in wireless communication protocols as 4 because I successfully implemented both UWB ranging and BLE communication, overcoming technical challenges related to signal interference and precision. For cryptography and security, I achieved level 4 by implementing a complete security architecture including encryption, authentication, and attack prevention mechanisms, which was validated through security audits. My cloud integration competence is at level 3 as I successfully integrated AWS IoT Core services but with guidance from NXP engineers for some advanced configurations. Project management is rated 3 because I effectively coordinated between multiple stakeholders and maintained project timelines, though the complexity required occasional supervisor intervention for critical decisions.",

      "relacao_projeto_profissional": "This project directly aligns with my career goal of working in the embedded systems and IoT industry, particularly in automotive and security-focused applications. The competences developed in wireless communication, cryptography, and cloud integration are essential for modern connected vehicle systems and smart mobility solutions. I aim to pursue roles such as IoT Systems Engineer or Embedded Security Specialist in automotive companies or technology firms developing next-generation connected devices. The experience with industrial partners ACTIA and NXP has provided valuable insights into industry practices, standards, and the complete product development lifecycle, which will be crucial for my professional success in embedded systems and IoT domains."
    },
    {
      "id": "projeto-ml-fall-detection",
      "titulo": "Image Fall Detection with Machine Learning",
      "periodo": "1st Semester 2024",
      "status": "In progress",

      "tecnologias": [
        "Python",
        "TensorFlow",
        "Keras",
        "NumPy"
      ],

      "tags": [
        "Machine Learning",
        "Computer Vision",
        "Deep Learning"
      ],

      "imagens": [
        "assets/img/projeto-ml.jpg",
        "assets/img/projeto-ml-results.jpg"
      ],

      "relatorio_pdf": "reports/projeto-ml.pdf",

      "descricao": "Machine-learning project focused on computer vision using TensorFlow and Keras to detect falls in images. The system employs convolutional neural networks (CNN) to classify images into fall and no-fall categories with high accuracy. This project addresses a critical need in elderly care and safety monitoring by providing automated detection capabilities that can alert caregivers in real-time. The end-to-end implementation covers data collection, preprocessing, model training, validation, and deployment considerations.",

      "tecnica": "The technical core involves designing and training a Convolutional Neural Network (CNN) architecture using TensorFlow and Keras frameworks. We explored various architectures including custom CNNs and transfer learning approaches using pre-trained models such as VGG16 and ResNet50. Data preprocessing includes image normalization, augmentation techniques (rotation, flipping, zooming) to improve model generalization, and proper train-validation-test splitting. The model training process involves hyperparameter tuning (learning rate, batch size, number of epochs), implementation of callbacks for early stopping and learning rate scheduling, and use of appropriate loss functions and optimizers (Adam, SGD). Performance evaluation uses metrics including accuracy, precision, recall, F1-score, and confusion matrices. NumPy is extensively used for numerical operations and data manipulation throughout the pipeline.",

      "sistema_de_curso": "This project was conducted as part of a Machine Learning course with approximately 60 hours of workload over one semester. The course structure included theoretical lectures (CM) covering ML fundamentals, neural networks, and computer vision concepts (20 hours), practical tutorial sessions (TD) for hands-on coding exercises and problem-solving (15 hours), and supervised lab sessions (TP) where the project was developed incrementally (25 hours). Activities included studying ML theory, implementing algorithms from scratch for learning purposes, working on the fall detection project with weekly milestones, presenting progress updates, and preparing a final technical report and demonstration.",

      "matriz_competencia": [
        {
          "nota": 3,
          "titulo": "Deep Learning and Neural Networks",
          "descricao": "Understanding of CNN architectures, backpropagation, optimization algorithms, and practical implementation using modern frameworks like TensorFlow and Keras."
        },
        {
          "nota": 3,
          "titulo": "Computer Vision Techniques",
          "descricao": "Application of image preprocessing, data augmentation, and visual feature extraction techniques for classification tasks in real-world scenarios."
        },
        {
          "nota": 2,
          "titulo": "Model Evaluation and Validation",
          "descricao": "Proper use of evaluation metrics, cross-validation techniques, and analysis of model performance to ensure reliable and generalizable results."
        },
        {
          "nota": 3,
          "titulo": "Python Programming for ML",
          "descricao": "Proficient use of Python and scientific libraries (TensorFlow, Keras, NumPy) for implementing complete machine learning pipelines from data to deployment."
        }
      ],

      "justificativa": "My deep learning competence is rated 3 because I successfully designed, trained, and optimized CNN models, though some advanced techniques like custom loss functions required additional research. Computer vision competence is also 3 as I effectively applied preprocessing and augmentation techniques that significantly improved model performance. Model evaluation is rated 2 because while I used appropriate metrics and validation strategies, I could improve in advanced techniques like cross-validation and bias-variance analysis. Python programming for ML is rated 3 as I demonstrated proficiency in using TensorFlow and Keras frameworks, implementing the complete pipeline independently with occasional reference to documentation.",

      "relacao_projeto_profissional": "This project is highly relevant to my interest in intelligent embedded systems and IoT applications. Machine learning, particularly computer vision, is increasingly integrated into embedded devices for edge computing scenarios. I aspire to work in areas where ML models are deployed on resource-constrained devices for real-time applications such as smart surveillance, autonomous systems, or health monitoring. The competences in ML model development, optimization, and evaluation are essential for roles like ML Engineer, Computer Vision Specialist, or Embedded AI Developer. This experience provides a foundation for future work in deploying ML models on edge devices, which is a growing field in IoT and smart systems."
    },
    {
      "id": "app-gestao-tarefas",
      "titulo": "Task Management App",
      "periodo": "1st Semester 2024",
      "status": "Completed",

      "tecnologias": [
        "React",
        "Node.js",
        "Express",
        "MongoDB",
        "WebSocket"
      ],

      "tags": [
        "Web Development",
        "Full Stack",
        "Real-time"
      ],

      "imagens": [
        "assets/img/app-tarefas.jpg",
        "assets/img/app-tarefas-mobile.jpg"
      ],

      "relatorio_pdf": "reports/app-gestao-tarefas.pdf",

      "descricao": "Full-stack web application for managing tasks and projects with real-time synchronization capabilities. Built with React on the frontend and Node.js with Express on the backend, this application provides an intuitive interface for task creation, editing, organization, and collaboration. The system implements secure user authentication, role-based access control, and real-time updates via WebSockets, enabling multiple users to collaborate on shared projects seamlessly. The application demonstrates modern web development practices and scalable architecture design.",

      "tecnica": "The frontend is built using React with functional components, hooks (useState, useEffect, useContext), and React Router for navigation. State management is handled through Context API and local state for optimal performance. The UI is responsive using CSS Grid and Flexbox, ensuring compatibility across devices. The backend uses Node.js with Express framework implementing RESTful API endpoints for CRUD operations on tasks and projects. MongoDB serves as the NoSQL database with Mongoose ODM for data modeling and validation. User authentication uses JWT (JSON Web Tokens) with bcrypt for password hashing. Real-time functionality is achieved through WebSocket connections using Socket.io library, enabling instant updates when tasks are created, modified, or deleted by any team member. The application implements proper error handling, input validation, and security measures including CORS configuration and rate limiting.",

      "sistema_de_curso": "This project was part of a Web Development course with approximately 70 hours of workload. The course included theoretical lectures (CM) covering web technologies, HTTP protocol, REST APIs, and modern JavaScript frameworks (25 hours), tutorial sessions (TD) for discussing design patterns, best practices, and code reviews (20 hours), and practical lab sessions (TP) for hands-on development (25 hours). The project was developed iteratively over the semester with weekly deliverables including UI mockups, API design documentation, implementation milestones, and a final presentation demonstrating the complete application with live demos.",

      "matriz_competencia": [
        {
          "nota": 3,
          "titulo": "Frontend Development with React",
          "descricao": "Proficient in building modern, responsive web interfaces using React, hooks, component composition, and state management for complex applications."
        },
        {
          "nota": 3,
          "titulo": "Backend Development and REST APIs",
          "descricao": "Solid understanding of Node.js and Express for creating RESTful APIs with proper routing, middleware, authentication, and database integration."
        },
        {
          "nota": 3,
          "titulo": "Real-time Communication",
          "descricao": "Implementation of WebSocket-based real-time features using Socket.io for instant data synchronization across multiple clients."
        },
        {
          "nota": 2,
          "titulo": "Database Design and Management",
          "descricao": "Understanding of NoSQL database design with MongoDB, including schema modeling, indexing, and query optimization for web applications."
        }
      ],

      "justificativa": "Frontend development is rated 3 as I successfully built a complete React application with proper component architecture, though some advanced patterns like custom hooks could be improved. Backend development is also 3 because I implemented a robust API with authentication and proper error handling independently. Real-time communication is rated 3 as I successfully integrated WebSocket functionality for multi-user collaboration, though the implementation required some debugging and iteration. Database design is rated 2 as I designed appropriate schemas and used MongoDB effectively, but could improve in advanced topics like indexing strategies and performance optimization.",

      "relacao_projeto_profissional": "While my primary interest is in embedded systems and IoT, full-stack web development skills are increasingly valuable in this field. Many IoT systems require web-based dashboards for monitoring and control, and understanding both frontend and backend development enables me to create complete solutions. This project has equipped me with skills to develop user interfaces for embedded system projects, implement cloud-based management platforms, and create data visualization tools. These competences are particularly relevant for roles in IoT platform development where embedded devices communicate with cloud services and web applications, bridging the gap between hardware and user-facing software."
    },
    {
      "id": "sistema-monitoramento-iot",
      "titulo": "IoT Monitoring System for Agriculture",
      "periodo": "2nd Semester 2024",
      "status": "Completed",

      "tecnologias": [
        "ESP32",
        "Arduino",
        "MQTT",
        "Python",
        "Flask",
        "Chart.js"
      ],

      "tags": [
        "IoT",
        "Hardware",
        "Agriculture",
        "Sensors"
      ],

      "imagens": [
        "assets/img/iot-agriculture.jpg",
        "assets/img/iot-dashboard.jpg",
        "assets/img/iot-sensor.jpg"
      ],

      "relatorio_pdf": "reports/sistema-monitoramento-iot.pdf",

      "descricao": "Complete Internet of Things system designed for monitoring environmental conditions in agricultural settings. The system uses ESP32 microcontrollers with various sensors to collect real-time data on temperature, humidity, soil moisture, and light intensity. A web-based dashboard provides visualization of sensor data, historical trends, and alerts when critical thresholds are exceeded. The project demonstrates integration of hardware and software components in a practical IoT application, addressing real-world needs in precision agriculture and smart farming.",

      "tecnica": "The hardware layer consists of ESP32 microcontrollers programmed using Arduino framework, interfaced with DHT22 sensors (temperature and humidity), soil moisture sensors, and LDR light sensors. The ESP32 connects to WiFi and publishes sensor readings to an MQTT broker (Mosquitto) using the PubSubClient library. The backend is built with Python and Flask framework, subscribing to MQTT topics to receive sensor data, storing it in a SQLite database, and providing REST API endpoints for data retrieval. The web dashboard uses HTML, CSS, and JavaScript with Chart.js library for real-time data visualization through dynamic graphs and charts. An alert system monitors sensor values and sends email notifications via SMTP when values exceed configured thresholds. The system architecture follows IoT best practices with message queuing for reliability, data persistence, and scalable design.",

      "sistema_de_curso": "This project was part of an IoT Systems course with approximately 80 hours of workload. The course structure included theoretical lectures (CM) on IoT architectures, communication protocols, sensor technologies, and cloud platforms (30 hours), tutorial sessions (TD) for problem-solving and system design exercises (20 hours), and hands-on lab sessions (TP) for building the project with incremental milestones (30 hours). Activities included studying IoT protocols and architectures, hands-on work with microcontrollers and sensors, developing the monitoring system incrementally, weekly progress presentations, and preparing comprehensive documentation including system architecture diagrams, circuit schematics, and a final technical report.",

      "matriz_competencia": [
        {
          "nota": 4,
          "titulo": "Embedded Systems Programming",
          "descricao": "Advanced skills in programming microcontrollers (ESP32) with Arduino framework, interfacing with various sensors, and managing WiFi connectivity and communication protocols."
        },
        {
          "nota": 3,
          "titulo": "IoT Communication Protocols",
          "descricao": "Practical implementation of MQTT protocol for efficient machine-to-machine communication in IoT systems with proper topic design and quality of service management."
        },
        {
          "nota": 3,
          "titulo": "Backend Development for IoT",
          "descricao": "Development of backend services using Python and Flask to process sensor data, implement business logic, and provide APIs for frontend applications."
        },
        {
          "nota": 2,
          "titulo": "Data Visualization and UI Design",
          "descricao": "Creation of effective data visualization dashboards using Chart.js for presenting time-series sensor data in meaningful and actionable ways."
        }
      ],

      "justificativa": "Embedded systems programming is rated 4 as I demonstrated strong competence in working with ESP32, managing multiple sensors, implementing reliable WiFi communication, and troubleshooting hardware issues independently. IoT communication protocols receives a 3 because I successfully implemented MQTT messaging with proper topic structure and QoS settings, though advanced features like retained messages could be explored further. Backend development is rated 3 as I built a functional Flask application handling MQTT subscriptions, database operations, and API endpoints effectively. Data visualization is rated 2 because while I created a working dashboard with Chart.js, the UI design and user experience could be enhanced with more advanced visualization techniques and responsive design patterns.",

      "relacao_projeto_profissional": "This project is directly aligned with my career aspirations in embedded systems and IoT. It encompasses the complete IoT stack from hardware sensors to cloud services and user interfaces, which is essential knowledge for IoT professionals. I aim to work in industries developing smart systems, connected devices, or industrial IoT solutions where such end-to-end understanding is valuable. The competences in embedded programming, communication protocols, and system integration are core requirements for roles like IoT Systems Engineer, Embedded Software Developer, or Hardware Integration Specialist. This project has prepared me to tackle real-world IoT challenges in sectors such as smart agriculture, industrial automation, smart cities, and environmental monitoring."
    },
    {
      "id": "api-rest-ecommerce",
      "titulo": "REST API for E-commerce",
      "periodo": "1st Semester 2024",
      "status": "Completed",

      "tecnologias": [
        "Node.js",
        "Express",
        "PostgreSQL",
        "JWT",
        "Swagger"
      ],

      "tags": [
        "Backend",
        "API",
        "E-commerce",
        "Database"
      ],

      "imagens": [
        "assets/img/api-ecommerce.jpg",
        "assets/img/api-swagger.jpg"
      ],

      "relatorio_pdf": "reports/api-rest-ecommerce.pdf",

      "descricao": "Comprehensive RESTful API backend for an e-commerce platform, managing products, orders, users, and inventory. The API follows REST architecture best practices and implements robust authentication, authorization, data validation, and error handling mechanisms. Complete documentation is provided through Swagger/OpenAPI specification, making the API easy to understand and integrate. The system includes features for product catalog management, shopping cart operations, order processing, payment integration, and inventory tracking with transaction control to ensure data consistency.",

      "tecnica": "The API is built using Node.js with Express framework, implementing RESTful endpoints following HTTP methods conventions (GET, POST, PUT, DELETE, PATCH). Authentication and authorization use JWT (JSON Web Tokens) with role-based access control (RBAC) for admin and customer roles. PostgreSQL serves as the relational database with proper schema design including tables for users, products, orders, order items, and inventory. Sequelize ORM handles database operations with migrations for version control. Input validation uses Joi library to ensure data integrity. Error handling middleware provides consistent error responses with appropriate HTTP status codes. Payment processing integration uses Stripe API for secure transaction handling. API documentation is generated automatically using Swagger/OpenAPI specification with detailed endpoint descriptions, request/response schemas, and example payloads. The system implements transaction management for critical operations like order creation and inventory updates to maintain database consistency.",

      "sistema_de_curso": "This project was developed as part of a Backend Development course with approximately 75 hours of workload. The course included theoretical lectures (CM) covering web services, REST architecture, database design, security principles, and API best practices (28 hours), tutorial sessions (TD) for discussing design patterns, code quality, and reviewing implementations (22 hours), and practical lab sessions (TP) for hands-on development and testing (25 hours). The project was developed incrementally with specific milestones including API design and documentation, authentication implementation, database schema and migrations, business logic implementation, testing and debugging, and final presentation with live API demonstrations.",

      "matriz_competencia": [
        {
          "nota": 3,
          "titulo": "RESTful API Design and Implementation",
          "descricao": "Solid understanding of REST principles and practical implementation of well-structured APIs with proper HTTP methods, status codes, and resource naming conventions."
        },
        {
          "nota": 3,
          "titulo": "Authentication and Security",
          "descricao": "Implementation of secure authentication using JWT, password hashing, role-based access control, and security best practices for protecting API endpoints."
        },
        {
          "nota": 4,
          "titulo": "Database Design and SQL",
          "descricao": "Advanced skills in relational database design with PostgreSQL, including normalization, indexing, relationships, and complex queries with transaction management."
        },
        {
          "nota": 2,
          "titulo": "API Documentation and Testing",
          "descricao": "Creation of comprehensive API documentation using Swagger and implementation of basic API testing, though advanced testing strategies could be improved."
        }
      ],

      "justificativa": "RESTful API design is rated 3 because I successfully implemented a complete API following REST principles with proper endpoint structure and HTTP conventions, though some advanced patterns like HATEOAS were not implemented. Authentication and security receives 3 as I implemented robust JWT-based authentication and role-based access control effectively. Database design is rated 4 because I demonstrated strong competence in designing normalized schemas, implementing complex relationships, using transactions, and writing efficient queries with proper indexing. API documentation is rated 2 as I created functional Swagger documentation covering all endpoints, but the quality and detail of descriptions could be enhanced, and automated testing coverage could be more comprehensive.",

      "relacao_projeto_profissional": "While backend development for e-commerce may seem distant from embedded systems, the skills acquired are highly transferable to IoT backend services. Many IoT solutions require robust APIs for device management, data collection, and system control. Understanding database design, authentication, and API development is crucial for building cloud platforms that interact with embedded devices. I envision applying these backend skills to create management platforms for IoT devices, implement device provisioning systems, or develop data processing pipelines for sensor networks. This project has equipped me with the backend competence needed to build complete IoT solutions that bridge embedded hardware with cloud services and user applications."
    },
    {
      "id": "ethics",
      "titulo": "Social Psychology and Ethics",
      "periodo": "1st Semester 2025–2026",
      "status": "Completed",

      "tecnologias": [
        "Presentation",
        "Research"
      ],

      "tags": [
        "Ethics",
        "Social Psychology",
        "Group Dynamics"
      ],

      "imagens": [
        "assets/img/ethics.jpg"
      ],

      "relatorio_pdf": "reports/ethics.pptx",

      "descricao": "In this course I was introduced to social psychology as a human sciences discipline that studies the relationships between individuals, groups and situations. We explored how group dynamics, influence, stereotypes, intercultural relations, manipulation, conflict management and psychosocial risks shape behaviours in everyday life and in professional settings.\nAll these concepts were constantly questioned from an ethical perspective: who is responsible for what, what makes an action just, and what it means for an action to be truly free. A central part of the course was also devoted to ethics in engineering and to intercultural communication, which I worked on through a dedicated presentation on intercultural relations and cultural adaptation.",

      "tecnica": "I first worked on a detailed analysis of the movie 12 Angry Men (1957), which we used as a practical case for social influence and group decision-making. Through this film I observed conformity, minority influence, stereotypes about social class and origin, emotional versus rational arguments, and the role of one persistent individual who challenges the group and gradually shifts the collective decision. This provided a concrete illustration of concepts such as group pressure, opinion change and the importance of evidence-based reasoning.\n\nI then studied the foundations of social psychology and group dynamics: how the field sits at the intersection of psychology and sociology, and how it focuses on the interactions between individual, group and situation. We looked at key authors such as Elton Mayo (Hawthorne effect and the importance of social motivations), Jacob Moreno (sociometry and affective networks in groups) and Kurt Lewin (field theory and group dynamics as a system of forces). I learned to use the criteria that define a group (minimum number of people, shared goals, interdependence, roles, norms and shared values) and to distinguish between different types of groups: crowds, small primary groups, large momentary groups and formal organisations.\n\nAs part of the course I prepared and delivered, in a pair, a full presentation on intercultural communication. We started from the UNESCO definition of culture as the set of values, norms, practices, beliefs and ways of life shared by a group, and highlighted that culture also includes invisible aspects such as communication styles and relationships to time, authority and emotions. We then introduced micro-cultures (family, student cohort, project team, local community), showing how each group creates its own codes and rituals and how this explains differences between people from the same country. I worked on defining intercultural communication as the interaction between people from different cultures who must manage diverging codes and references, and on the key competences needed: active listening, curiosity, reflexivity, the ability to question one's stereotypes and to manage uncertainty in exchanges.\n\nI also studied concrete strategies for adapting to other cultures: keeping an open attitude, observing without immediate judgement, adjusting verbal and non-verbal communication (for example, simplifying language, paying attention to body language, or respecting hierarchy when it is central), and asking for clarification when in doubt. We presented the classic phases of cultural adaptation (honeymoon, slump, realisation and adaptation) and explained that cultural shock is a normal part of the learning process. Another key concept was ethnocentrism – the tendency to see one's own culture as the central or superior reference – and how recognising this tendency is crucial to develop more respectful and effective intercultural relations. Finally, we proposed practical tools to communicate across cultures: using clear and concrete language, avoiding jargon and idioms, slowing down and articulating, using multiple supports (oral, written, diagrams, examples) and regularly checking understanding by asking others to reformulate the message. All of this forced me to structure complex ideas, synthesise academic definitions and translate them into accessible examples for my classmates.\n\nOn the ethical side, I worked with precise definitions of morality, ethics and deontology. I learned that morality refers to a set of values and concrete rules that distinguish good from bad, while ethics is a reflective process that questions human actions and their consequences. Deontology focuses on professional duties. We also studied several ethical frameworks for decision-making: ethics of reciprocity (\"treat others as you would like to be treated\"), duty-based ethics (Kantian universal principles), utilitarian ethics (seeking the greatest good for the greatest number) and ethics of conviction (coherence between personal values and actions). These tools gave me a structured way to analyse dilemmas instead of staying at a purely intuitive level.\n\nThe course also highlighted a three-question approach to ethical reflection: Where does this practice come from (historical and social origins)? What is it for (its meaning and usefulness)? Where is it going (its long-term impacts and finalities)? Applying these questions to engineering topics trained me to move between technical facts, societal impacts and personal responsibility. We connected this to digital ethics: cybercrime, manipulation, privacy and data protection, big data, social media, right to disconnect, and the environmental footprint of digital technologies (energy consumption and electronic waste).\n\nFinally, I linked all these notions to the ethical charters and responsibilities of engineers. I worked with the idea that engineers must balance what is technically possible with what is socially desirable, by evaluating risks, long-term impacts, and the social acceptability of technologies. This technical understanding of ethics and intercultural issues in engineering is directly relevant for my future work with connected objects, data and smart systems.",

      "sistema_de_curso": "The course was organised in around 14 sessions of 1h15. We started with a common screening and discussion of 12 Angry Men, followed by interactive lectures based on the professor’s slides on social psychology, group dynamics and ethics. The class was then divided into pairs, and each pair prepared a 20–30 minute presentation on a specific topic such as influence, manipulation, stereotypes, intercultural relations, conflict management, psychosocial risks or digital ethics. With my partner, I was responsible for the presentation on intercultural communication and cultural adaptation. Throughout the semester we combined readings, small in-class exercises, whole-class discussions and reflective questions about engineering practice, which made the learning process very participative and strongly oriented towards student involvement.",

      "matriz_competencia": [
        {
          "nota": 3,
          "titulo": "Analyse Group Situations Using Concepts from Social Psychology",
          "descricao": "Ability to observe and interpret group dynamics, social influence processes, conformity patterns, and collective decision-making mechanisms using theoretical frameworks from social psychology, as demonstrated through the analysis of 12 Angry Men and understanding of key concepts from Mayo, Moreno and Lewin."
        },
        {
          "nota": 3,
          "titulo": "Understand Interpersonal Relations in Professional and Intercultural Situations",
          "descricao": "Competence in recognizing cultural differences, managing intercultural communication challenges, adapting communication styles across contexts, and navigating professional relationships in diverse environments, developed through the presentation on intercultural communication and study of micro-cultures, ethnocentrism and cultural adaptation phases."
        },
        {
          "nota": 3,
          "titulo": "Integrate Reflection on Socio-Ecological Issues into Career Path",
          "descricao": "Capacity to connect technical decisions with their broader societal and environmental impacts, considering digital ethics issues such as data privacy, environmental footprint of technologies, and the social acceptability of engineering solutions in the context of IoT and connected systems."
        },
        {
          "nota": 3,
          "titulo": "Identify the Ethical Dimensions of Situations and Argue One's Position",
          "descricao": "Ability to recognize ethical dilemmas in professional contexts, apply multiple ethical frameworks (reciprocity, duty-based, utilitarian, conviction-based ethics) to analyze situations, and articulate well-reasoned positions using the three-question approach (origins, purpose, long-term impacts) when evaluating engineering practices."
        },
        {
          "nota": 3,
          "titulo": "Sharpen Critical Thinking, Decentring and Self-Reflection: Meta-Cognition",
          "descricao": "Development of reflexive thinking to question one's own assumptions, stereotypes and cognitive biases, recognize the limits of one's perspective, practice decentring to understand diverse viewpoints, and engage in continuous self-evaluation of one's reasoning processes and ethical judgements."
        }
      ],

      "justificativa": "I rated all five competences at level 3 because the course provided substantial opportunities to develop and demonstrate each one. For analysing group situations, I successfully applied social psychology concepts to concrete cases like 12 Angry Men, identifying conformity, minority influence and group pressure dynamics. My understanding of interpersonal relations in intercultural contexts reached level 3 through the comprehensive presentation I prepared on intercultural communication, where I researched and synthesized complex concepts about culture, micro-cultures, adaptation strategies and ethnocentrism. Integrating socio-ecological reflection is rated 3 as I consistently connected course content to real-world implications in my field, particularly digital ethics issues relevant to IoT and connected systems. Identifying ethical dimensions and arguing positions merits 3 because I learned to use multiple ethical frameworks systematically and apply the three-question method to engineering dilemmas. Finally, critical thinking and meta-cognition reached level 3 through continuous practice in questioning assumptions, recognizing biases, and reflecting on my own reasoning throughout the course activities, discussions and assignments.",

      "relacao_projeto_profissional": "This course is directly connected to my professional project as an engineer working with embedded systems, IoT and smart, data-driven technologies in international and multicultural environments. In these fields, technical choices are never neutral: they affect privacy, safety, environmental impact, work organisation and power relations inside companies and in society, and they are often implemented by teams composed of people from very different cultural backgrounds. By studying social psychology, ethics and intercultural communication, I learned to see teams, organisations and users as complex groups with histories, norms and expectations, and to anticipate how technologies and communication styles can reinforce or challenge existing dynamics.\n\nFor my future roles in industry or research, this means I am better prepared to question the purpose of the systems I design, to evaluate their social and environmental impacts, and to defend responsible choices when faced with dilemmas between performance, cost and ethical concerns. The work on intercultural communication in particular strengthened my ability to collaborate with international colleagues, adapt my language and behaviour, and transform cultural differences into an asset rather than a source of conflict. All of this contributes to building a professional profile of an engineer who is not only technically competent, but also aware of his responsibilities towards people, organisations and the broader society."
    }
  ]
}
